src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег/Ext/ManagerModule.bsl
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//TODO УЗ: печать — встроиться в подменю «Печать» хозяина через УЗ_Среда (УправлениеПечатью БСП); сейчас ПКО печатает своя команда ПечатьПКО
//	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьПКО");
//    Если НужноПечататьМакет Тогда
//        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//        КоллекцияПечатныхФорм,
//        "ПечатьПКО",
//        НСтр("ru = 'Приходный кассовый ордер'"),
//        ПечатьПКО(МассивОбъектов, ОбъектыПечати),
//        ,
//        "Документ.УЗ_ПриходДенег.ПечатьПКО");
//    КонецЕсли;
	
КонецПроцедуры 

Функция ПечатьПКО(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.УЗ_ПриходДенег.ПолучитьМакет("ПечатьПКО");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПКО.АвторДокумента КАК АвторДокумента,
	|	ПКО.ВидОперации КАК ВидОперации,
	|	ПКО.Дата КАК Дата,
	|	ПКО.ДокументОснования КАК ДокументОснования,
	|	ПКО.Касса КАК Касса,
	|	ПКО.ФизЛицо КАК Контрагент,
	|	ПКО.Комментарий КАК Комментарий,
	|	ПКО.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПКО.Номер КАК Номер,
	|	ПКО.СуммаДокумента КАК СуммаДокумента,
	|	ПКО.Родитель КАК Родитель,
	|	ПКО.Подразделение КАК Подразделение,
	|	ПКО.Организация КАК Организация
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК ПКО
	|ГДЕ
	|	ПКО.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СуммаДокумента) Тогда
			Сумма = Выборка.СуммаДокумента;
		Иначе
			Сумма = Выборка.СуммаБонусов;
		КонецЕсли;		
		
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.СуммаРубКоп       = Формат(Сумма, "ЧЦ=15; ЧДЦ=2");    
		Шапка.Параметры.Сумма             = Формат(Сумма, "ЧЦ=15; ЧДЦ=2");
		Шапка.Параметры.СуммаПрописью     = ЧислоПрописью(Сумма,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		Шапка.Параметры.ОрганизацияПоОКПО = "";
		Шапка.Параметры.ДатаДокумента     = Выборка.Дата;
		Шапка.Параметры.НомерДокумента    = УЗ_ОбщийКлиентСервер.НомерНаПечать(Выборка.Номер);
		Шапка.Параметры.ПринятоОт		  = ?(ЗначениеЗаполнено(Выборка.Родитель),Выборка.Родитель,Выборка.Контрагент);
		Шапка.Параметры.Основание		  = Выборка.НазначениеПлатежа;
	
		Шапка.Параметры.КодДебета 		  = "50.01";
		Шапка.Параметры.СубСчет   		  = "62.01, 62.02";
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			Шапка.Параметры.ПредставлениеОрганизации = Выборка.Организация.Наименование;
		КонецЕсли;
		
		Шапка.Параметры.ПредставлениеПодразделения = Выборка.Подразделение;
		
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Номер = Данные.Номер;
	Пока Лев(Номер, 1) = "0" Цикл 
		Номер = Прав(Номер, СтрДлина(Номер) - 1);
	КонецЦикла;

	Представление = "ПКО (оплата+) " +Номер+ " от " +Формат(Данные.Дата,"ДФ=д.ММ.гггг")+ " " +Данные.Ссылка.ПредметОбучения;	
	
КонецПроцедуры
